cf_billing/Documents/энргУстановитьДиапазоныДифференцированногоТарифа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьДиапазоныДифференцированногоТарифа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргНастройкаДиапазоновДифференцированногоТарифа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыДиапазонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДиапазоныДифференцированныхТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диапазон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДиапазоныДифференцированныхТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>От</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>До</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргУстановитьДиапазоныДифференцированногоТарифа/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКомандыПриСозданииНаСервере();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//Объект.Дата = ТекущаяДатаСеанса();
		Объект.Организация = Справочники.Организации.НашаОрганизация;
		
		ОсновныеРеквизиты = Новый Структура;
		ОсновныеРеквизиты.Вставить("Дата", Объект.Дата);
		ОсновныеРеквизиты.Вставить("Организация", Объект.Организация);
		ОсновныеРеквизиты.Вставить("Район", Объект.Район);
		ОсновныеРеквизиты.Вставить("Услуга", Объект.Услуга);
		
		Объект.Дата = ОпределитьПериодНачисления(ОсновныеРеквизиты);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	ЗаполнитьСвязанныеРеквизиты(); 
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСвязанныеРеквизиты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОсновныеРеквизиты = ОсновныеРеквизиты();
	Объект.Дата = ОпределитьПериодНачисления(ОсновныеРеквизиты);
	ОсновныеРеквизиты.Дата = Объект.Дата;
	ЕстьДубликатДокумента(ОсновныеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОсновныеРеквизиты = ОсновныеРеквизиты();
	Объект.Дата = ОпределитьПериодНачисления(ОсновныеРеквизиты);
	ОсновныеРеквизиты.Дата = Объект.Дата;
    ЕстьДубликатДокумента(ОсновныеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	ОсновныеРеквизиты = ОсновныеРеквизиты();
	Объект.Дата = ОпределитьПериодНачисления(ОсновныеРеквизиты);
	ОсновныеРеквизиты.Дата = Объект.Дата;
    ЕстьДубликатДокумента(ОсновныеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	ОсновныеРеквизиты = ОсновныеРеквизиты(); 
	ЕстьДубликатДокумента(ОсновныеРеквизиты);
	ЕдИзм = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Услуга, "ЕдиницаИзмерения");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРазрезыДиапазонов

&НаКлиенте
Процедура РазрезыДиапазоновПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.РазрезыДиапазонов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСвязанныхТаблиц(ТекущиеДанные); 
	
КонецПроцедуры

&НаКлиенте
Процедура РазрезыДиапазоновПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.РазрезыДиапазонов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ТекДанные.ИдентификаторСтроки);
	Коллекция = Объект.ДиапазоныДифференцированныхТарифов;
	Строки = Коллекция.НайтиСтроки(СтруктураПоиска);	
	Для Каждого УдаляемаяСтрока из Строки Цикл 			
		Коллекция.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрезыДиапазоновПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ИдентификаторКопируемойСтроки = Элемент.ТекущиеДанные.ИдентификаторСтроки;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		УстановитьОтборСвязанныхТаблиц(Элемент.ТекущиеДанные); 
		
		Если Копирование Тогда
			СкопироватьПодчиненныеТаблицы(ИдентификаторКопируемойСтроки, Элемент.ТекущиеДанные.ИдентификаторСтроки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьОтборСвязанныхТаблиц(ТекущиеДанные)
		
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(
		Элементы.ДиапазоныДифференцированныхТарифов, 
		"ИдентификаторСтроки", 
		ТекущиеДанные.ИдентификаторСтроки);
		
КонецПроцедуры

&НаСервере
Процедура СкопироватьПодчиненныеТаблицы(ИдентификаторКопируемойСтроки, ИдентификаторТекущийСтроки)
	
	Отборы = Новый Структура("ИдентификаторСтроки", ИдентификаторКопируемойСтроки);
	НайденныеСтроки = Объект.ДиапазоныДифференцированныхТарифов.НайтиСтроки(Отборы);
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		
		Нстрока = Объект.ДиапазоныДифференцированныхТарифов.Добавить();
		ЗаполнитьЗначенияСвойств(Нстрока, НайденнаяСтрока,, "НомерСтроки");  
		Нстрока.ИдентификаторСтроки = ИдентификаторТекущийСтроки;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДиапазоныДифференцированныхТарифов

&НаКлиенте
Процедура ДиапазоныДифференцированныхТарифовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные = Элементы.РазрезыДиапазонов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДиапазоныДифференцированныхТарифовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.РазрезыДиапазонов.ТекущиеДанные;
		ИскомаяСтрока = -1;
		До = -1;
		Для Каждого СтрокаТаблицы Из Объект.ДиапазоныДифференцированныхТарифов Цикл 
			
			Если СтрокаТаблицы.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки Тогда
				ИскомаяСтрока = Макс(ИскомаяСтрока, СтрокаТаблицы.НомерСтроки);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ИскомаяСтрока > 0 Тогда
			До = Объект.ДиапазоныДифференцированныхТарифов[ИскомаяСтрока-1].До;
		КонецЕсли;
				
		Элемент.ТекущиеДанные.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
		Элемент.ТекущиеДанные.От = До + 1;
		Элемент.ТекущиеДанные.ЕдИзм = ЕдИзм;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДиапазоныДифференцированныхТарифовОтПриИзменении(Элемент)
	
	УстановитьРаницуДиапазонов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиапазоныДифференцированныхТарифовДоПриИзменении(Элемент)
	
	УстановитьРаницуДиапазонов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПредзаполнитьДиапазоны(Команда)
	
	ТекДанные = Элементы.РазрезыДиапазонов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Необходимо выбрать разрез диапазона перед заполнением диапазонов'"));
		
		Возврат;
		
	КонецЕсли;                         
	
	ПредзаполнитьДиапазоныНаСервере(ТекДанные.ИдентификаторСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОсновныеРеквизиты() 
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Объект.Ссылка);
	Результат.Вставить("Дата", Объект.Дата);
	Результат.Вставить("Организация", Объект.Организация);
	Результат.Вставить("Район", Объект.Район);
	Результат.Вставить("Услуга", Объект.Услуга);
	
	Возврат Результат;
	
КонецФункции

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ЗаполнитьСвязанныеРеквизиты()
	
	ЕдИзм = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Услуга, "ЕдиницаИзмерения");
	Для Каждого текСтрока из Объект.ДиапазоныДифференцированныхТарифов Цикл  
		текСтрока.Разница = текСтрока.До - текСтрока.От;
		текСтрока.ЕдИзм = ЕдИзм;
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервереБезКонтекста
Функция ОпределитьПериодНачисления(ОсновныеРеквизиты)
	
	ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(
	ОсновныеРеквизиты.Дата,
	ОсновныеРеквизиты.Организация,
	ОсновныеРеквизиты.Район);
	
	Возврат ПериодНачисления;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЕстьДубликатДокумента(ОсновныеРеквизиты)
	
	Документы.энргУстановитьДиапазоныДифференцированногоТарифа.
		ЕстьДубликатДокумента(ОсновныеРеквизиты);		
	
КонецПроцедуры

#КонецОбласти 

#Область СобытияТаблицыДиапазоныДифференцированныхТарифов

&НаСервере
Процедура ПредзаполнитьДиапазоныНаСервере(ИдентификаторСтроки)

	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(
	Объект.ДиапазоныДифференцированныхТарифов,
	Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
		
	РезультатЗапроса = Справочники.энргДиапазоныДифференцированныхТарифов.Дипазоны();	
	Выборка	= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НСтрока = Объект.ДиапазоныДифференцированныхТарифов.Добавить();
		НСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НСтрока.Диапазон = Выборка.Диапазон;
		НСтрока.ЕдИзм = ЕдИзм;
		
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРаницуДиапазонов()
	
	ТекущиеДанные = Элементы.ДиапазоныДифференцированныхТарифов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Разница = ТекущиеДанные.До - ТекущиеДанные.От;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды 

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ПодключаемыеКомандыПриСозданииНаСервере()
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
